# --- Command-line tools ---
brew "fish"
brew "yazi"
brew "neovim"
brew "java"
brew "gh"
brew "git"
brew "duti"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
# brew "mas"

# --- Main Apps ---
cask "arc"
cask "spotify"
cask "obsidian"
cask "zed"
cask "ghostty"
cask "visual-studio-code"

# --- Utilities ---
cask "raycast"
cask "leader-key"
cask "alt-tab"
cask "shottr"
cask "swift-quit"
cask "battery-toolkit"
cask "macmediakeyforwarder"
cask "git-credential-manager"
cask "font-jetbrains-mono-nerd-font"
# cask "antinote"
# cask "pearcleaner"

# --- Mac App Store Apps ---
# mas "Dropover", id: 1355679052

# --- Unsorted Brew Installs ---

