# --- Command-line tools ---
brew "fish"
brew "yazi"
brew "neovim"
brew "git"
brew "fzf"
brew "tmux"
brew "starship"
brew "spotify_player"
brew "blueutil"
brew "switchaudio-osx"
brew "duti"
brew "openjdk@21"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"

# --- Main Apps ---
cask "ghostty"
cask "spotify"
cask "zen"
cask "zed"

# --- Utilities ---
cask "leader-key"
cask "raycast"
cask "shottr"
cask "swift-quit"
cask "mhaeuser/mhaeuser/battery-toolkit"

cask "aerospace"
cask "font-sketchybar-app-font"
cask "font-jetbrains-mono-nerd-font"

# --- Unsorted Brew Installs ---
